---
type: DialogBoxShowingEventArgs
namespace: Autodesk.Revit.UI.Events
version: 2024
members: 2
tags: [revit-api, class]
---

# DialogBoxShowingEventArgs

`Autodesk.Revit.UI.Events.DialogBoxShowingEventArgs` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | OverrideResult | 2010 | `public bool OverrideResult ( int resultCode )` |
| Property | DialogId | 2017 | `public string DialogId { get ; }` |